# LineSegment Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LineSegment Members
LineSegment Class Methods Properties See Also
---
The LineSegment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the LineSegment |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EndParameter | Parameter associated with the end point. |
| EndPoint | End point of the line segment. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LineProperties | Access to the line (pen) properties of the line |
| StartParameter | Parameter associated with the start point. |
| StartPoint | Start point of the line segment. |

# See Also
LineSegment Class
Autodesk.Revit.DB Namespace